app/controllers/front/requests_controller.rb

SELECT  "available_tickets".* FROM "available_tickets" WHERE "available_tickets"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 162], ["LIMIT", 1]]
INSERT INTO "requests" ("first_name", "last_name", "company", "position", "email", "phone", "created_at", "updated_at", "facebook", "event_id", "available_ticket_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "tickets" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 162], ["user_id", 20], ["created_at", "2017-09-29 10:51:22.985028"], ["updated_at", "2017-09-29 10:51:22.985028"]]
UPDATE "available_tickets" SET "remaining_amount" = $1, "updated_at" = $2 WHERE "available_tickets"."id" = $3  [["remaining_amount", 39], ["updated_at", "2017-09-29 10:51:22.937712"], ["id", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "first_name", "last_name", "company", "position", "phone", "facebook") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @request = Request.new(request_params)
    @request.event = Event.most_recent
    @ticket = AvailableTicket.find(@request.available_ticket_id)

    if @ticket.approval == false && @ticket.price <= 0
      @request.approval_status = "approved"
      @request.payment_status = true
    elsif @ticket.approval == false && @ticket.price > 0
      @request.approval_status = "approved"
      @request.payment_status = false
    elsif @ticket.approval == true && @ticket.price <= 0
      @request.approval_status = "pending"
      @request.payment_status = true
    elsif @ticket.approval == true && @ticket.price > 0
      @request.approval_status = "pending"
      @request.payment_status = false
    end

    respond_to do |format|
      if @request.save
        # У выбранного билета уменьшаем кол-во доступных на 1
        # метод в модели AvailableTicket
        ticket = AvailableTicket.find(params[:request][:available_ticket_id])
        ticket.buy_ticket

        # Сначала проверяем, может пользователь уже вообще залогинин
        # Если да, то присваиваем ему мероприятие через билет
        if current_user
          current_user.tickets.create(event_id: Event.most_recent.id)