app/controllers/front/static_pages_controller.rb

SELECT  "events".* FROM "events" ORDER BY "events"."sortable_date" DESC LIMIT $1  [["LIMIT", 1]]
---
  def home
    @event = Event.order(sortable_date: :asc).last