app/views/front/static_pages/home_sections/_programma.html.haml

SELECT "speakers".* FROM "speakers" INNER JOIN "lecture_speakers" ON "speakers"."id" = "lecture_speakers"."speaker_id" WHERE "lecture_speakers"."lecture_id" = $1  [["lecture_id", 2]]
---
        %p.g-program__title=lecture.title
        -if lecture.speakers.present?